<?php

$announce = new announces();

$regexName = '/^([A-Za-zàáâäãåąčćęèéêëėįìíîïłńòóôöõøùúûüųūÿýżźñçčšžÀÁÂÄÃÅĄĆČĖĘÈÉÊËÌÍÎÏĮŁŃÒÓÔÖÕØÙÚÛÜŲŪŸÝŻŹÑßÇŒÆČŠŽ∂ð\-\s]{2,35})$/';
$patientsList = $patients->getPatientsList();
$regexBirthDate = '/^((?:19|20)(?:[\d]{2}))-((?:[0][\d])|(?:[1][0-2]))-((?:(0|1|2)[\d])|(?:[3][0-1]))$/';
//$regexHour factorisée = '/^(([0|1][0-9])|([2][0-3]))[:]([0-5][0-9])$/';
$regexHour = '/^(([0]{1}[0-9]{1})|([1]{1}[0-9]{1})|([2]{1}[0-3]{1}))[:]([0-5]{1}[0-9]{1})$/';
$regexSelectPatient = '/^([0-9]{0,10})$/';
$formError = array();